### Boolean indexing array
- 가리고 싶은 부분은 가리고, 원하는 요소만 꺼내는 방법

- Series, DataFrame 객체에서 빠르게 원하는 원소를 추출하기 위해 사용

- Series, DataFrame 객체의 원소에 연산 후 True/False인 결과

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({'name': ['park', 'kim', 'lee'],'age': [10, 21, 31], 'gender': ['f', 'f', 'm'] })
df

   name  age gender
0  park   10      f
1   kim   21      f
2   lee   31      m

In [6]:
#age 컬럼 + 비교연산 -> 15세 이상

df_bool = df['age']>=15
df_bool

0    False
1     True
2     True
Name: age, dtype: bool

In [7]:
type(df_bool)

pandas.core.series.Series

In [8]:
df['name'] == 'kim'

0    False
1     True
2    False
Name: name, dtype: bool

In [11]:
df.loc[df_bool == True]

  name  age gender
1  kim   21      f
2  lee   31      m

In [14]:
# age가 15세 이상인 데이터만 추출
ageover15 = df[df_bool]   #직관적으로 생각

  name  age gender
1  kim   21      f
2  lee   31      m

# 과제

In [41]:

# 성별이 남자인 데이터만 추출하기

dg = df[df['gender']=='m']    # df.loc[condition] , loc를 이용해도 무방하다.
dg

  name  age gender
2  lee   31      m

In [42]:
# 15세 이상인 남자 데이터 추출하기

print(dg[dg['age'] >= 15]) # 방법1
print(df[(df['gender']=='m')&(df['age']>= 15)]) # 방법2

  name  age gender
2  lee   31      m
  name  age gender
2  lee   31      m

In [ ]:
# 산술연산자
# 비교연산자
# 논리연산자
# 비트연산자  
# html은 표에 있는 파일만 읽어온다.